In [4]:
print('hi')

hi

[GOOGLE](https://google.com)

텍스트

In [5]:
import pandas as pd
import numpy as np

In [6]:
pd.__version__

'1.4.2'

In [7]:
pd.__version__
pd.__version__

'1.4.2'

In [8]:
a=1
b=2

In [9]:
print(a)
print(b)

1
2

In [10]:
a

1

In [11]:
b

2

## series

- 같은종류의 데이터 집합,컬럼단위

In [12]:
pd.Series([1,3,5,7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int64

In [13]:
pd.Series([1,3,5,7,6,8],dtype="int32")

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int32

In [14]:
pd.Series([1,3,'5',7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: object

In [15]:
dates = pd.date_range("20130101",periods=6)

In [16]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(6,4),
             index = dates,
             columns=list("ABCD"))

In [18]:
list("ABCD")

['A', 'B', 'C', 'D']

In [19]:
pd.DataFrame(np.random.randn(6,4))

          0         1         2         3
0  0.171543 -1.500773  0.118516  0.376707
1 -1.418160  1.041158 -0.921892 -0.474594
2 -0.536409  1.157050  1.378791 -1.328132
3 -0.480936  0.667459 -0.349903 -0.982435
4 -1.353311  2.734768 -1.008356  1.882525
5  1.451639 -0.797721 -0.444692  0.295601

In [20]:
df2 = pd.DataFrame(
{
    "A":0.1,
    "B":pd.Timestamp("20130102"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([3]*4,dtype="int32"),
    "E":pd.Categorical(["test","train","test","train"]),
    "F":"foo"
}
)

In [21]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [22]:
type(df2)

pandas.core.frame.DataFrame

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [24]:
df2.shape

(4, 6)

In [25]:
df2.ndim

2

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [27]:
df2.head(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [28]:
df2.tail(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [29]:
df2.sample(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [30]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [31]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [32]:
df2.values

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [33]:
type(df2.index)

pandas.core.indexes.numeric.Int64Index

In [34]:
type(df2.columns)

pandas.core.indexes.base.Index

In [35]:
type(df2.values)

numpy.ndarray

In [36]:
df2.to_numpy()

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [37]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [38]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [40]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.379819 -0.009440 -0.116978 -1.082107
std    1.397022  0.886033  1.317342  0.882491
min   -2.108659 -1.030200 -1.796406 -2.124586
25%   -1.385596 -0.438155 -0.891338 -1.824356
50%   -0.482282 -0.111953 -0.400903 -0.993655
75%    0.827330  0.084564  0.917250 -0.525568
max    1.217145  1.594284  1.594526  0.090050

In [41]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   0.1  1.0  3.0
std    0.0  0.0  0.0
min    0.1  1.0  3.0
25%    0.1  1.0  3.0
50%    0.1  1.0  3.0
75%    0.1  1.0  3.0
max    0.1  1.0  3.0

In [42]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.277667    1.010552    1.217145   -1.433384   -2.108659   -1.242232
B    1.594284   -0.516349   -0.020333   -1.030200   -0.203574    0.119530
C    1.219209    0.011373   -1.796406   -0.917391    1.594526   -0.813179
D   -2.124586   -0.831380   -0.423630   -2.047165   -1.155929    0.090050

In [43]:
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.277667    1.010552    1.217145   -1.433384   -2.108659   -1.242232
B    1.594284   -0.516349   -0.020333   -1.030200   -0.203574    0.119530
C    1.219209    0.011373   -1.796406   -0.917391    1.594526   -0.813179
D   -2.124586   -0.831380   -0.423630   -2.047165   -1.155929    0.090050

In [44]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -1.242232  0.119530 -0.813179  0.090050
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-01  0.277667  1.594284  1.219209 -2.124586

In [45]:
df.shape

(6, 4)

In [46]:
df.sort_index(ascending=False,axis=1)

                   D         C         B         A
2013-01-01 -2.124586  1.219209  1.594284  0.277667
2013-01-02 -0.831380  0.011373 -0.516349  1.010552
2013-01-03 -0.423630 -1.796406 -0.020333  1.217145
2013-01-04 -2.047165 -0.917391 -1.030200 -1.433384
2013-01-05 -1.155929  1.594526 -0.203574 -2.108659
2013-01-06  0.090050 -0.813179  0.119530 -1.242232

In [47]:
df.sort_values(by=["A","B"],ascending=False)

                   A         B         C         D
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-06 -1.242232  0.119530 -0.813179  0.090050
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929

In [48]:
df['A']

2013-01-01    0.277667
2013-01-02    1.010552
2013-01-03    1.217145
2013-01-04   -1.433384
2013-01-05   -2.108659
2013-01-06   -1.242232
Freq: D, Name: A, dtype: float64

In [49]:
df[0:3]

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630

In [50]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165

df.loc[lable] 컬럼,인덱스 이름 그대로 
df.iloc[position] 인덱스

In [51]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [52]:
df.loc[['2013-01-03','2013-01-04'],['B','C']]

                   B         C
2013-01-03 -0.020333 -1.796406
2013-01-04 -1.030200 -0.917391

In [53]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [54]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [55]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [56]:
df.iloc[1:3,2:4]

                   C        D
2013-01-02  0.011373 -0.83138
2013-01-03 -1.796406 -0.42363

In [57]:
# df[조건]

In [58]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630

In [59]:
df['A']>0

2013-01-01     True
2013-01-02     True
2013-01-03     True
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [60]:
df[df>0]

                   A         B         C        D
2013-01-01  0.277667  1.594284  1.219209      NaN
2013-01-02  1.010552       NaN  0.011373      NaN
2013-01-03  1.217145       NaN       NaN      NaN
2013-01-04       NaN       NaN       NaN      NaN
2013-01-05       NaN       NaN  1.594526      NaN
2013-01-06       NaN  0.119530       NaN  0.09005

In [61]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [62]:
df2=df.copy()

In [63]:
df2["E"] =  ["one", "one", "two", "three", "four", "three"]

In [64]:
df2

                   A         B         C         D      E
2013-01-01  0.277667  1.594284  1.219209 -2.124586    one
2013-01-02  1.010552 -0.516349  0.011373 -0.831380    one
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630    two
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165  three
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929   four
2013-01-06 -1.242232  0.119530 -0.813179  0.090050  three

In [65]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [66]:
df2[df2["E"].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630   two
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929  four

In [67]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [68]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+["E"])

In [69]:
df1

                   A         B         C         D   E
2013-01-01  0.277667  1.594284  1.219209 -2.124586 NaN
2013-01-02  1.010552 -0.516349  0.011373 -0.831380 NaN
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630 NaN
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165 NaN

In [70]:
df1.loc[dates[0]:dates[1],'E']=1

In [71]:
df1

                   A         B         C         D    E
2013-01-01  0.277667  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552 -0.516349  0.011373 -0.831380  1.0
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630  NaN
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165  NaN

In [72]:
df4 = df1.copy()

In [75]:
df4.dropna(how='any',axis=0)

                   A         B         C         D    E
2013-01-01  0.277667  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552 -0.516349  0.011373 -0.831380  1.0

In [76]:
df4 = df1.copy()

In [77]:
df4.dropna(how='any',axis=1)

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165

In [78]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+["E"])
df1

                   A         B         C         D   E
2013-01-01  0.277667  1.594284  1.219209 -2.124586 NaN
2013-01-02  1.010552 -0.516349  0.011373 -0.831380 NaN
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630 NaN
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165 NaN

In [80]:
df1.dropna(how='all',axis=1)

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165

In [81]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    E
2013-01-01  0.277667  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552 -0.516349  0.011373 -0.831380  1.0
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630  NaN
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165  NaN

In [83]:
df1['E'].mean()

1.0

In [84]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01  0.277667  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552 -0.516349  0.011373 -0.831380  1.0
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630  1.0
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165  1.0

In [89]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[0],'A']=np.nan
df1.loc[dates[1],'B']=np.nan
df1.loc[dates[3],'C']=np.nan
df1.loc[dates[1],'D']=np.nan

df1

                   A         B         C         D    E
2013-01-01       NaN  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552       NaN  0.011373       NaN  1.0
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630  NaN
2013-01-04 -1.433384 -1.030200       NaN -2.047165  NaN

In [91]:
df1.mean()

A    0.264771
B    0.181250
C   -0.188608
D   -1.531794
E    1.000000
dtype: float64

In [92]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01  0.264771  1.594284  1.219209 -2.124586  1.0
2013-01-02  1.010552  0.181250  0.011373 -1.531794  1.0
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630  1.0
2013-01-04 -1.433384 -1.030200 -0.188608 -2.047165  1.0

In [93]:
df[(df2['E']=='two')|(df2['E']=='four')]

                   A         B         C         D
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929

In [94]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [95]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       3 non-null      float64
 4   E       2 non-null      float64
dtypes: float64(5)
memory usage: 364.0 bytes

In [96]:
df1.isna()

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [102]:
df1.isna().sum()/df1.shape[0]*100

A    25.0
B    25.0
C    25.0
D    25.0
E    50.0
dtype: float64

In [98]:
df1.isna().sum().sum()

6

In [100]:
df1.count()

A    3
B    3
C    3
D    3
E    2
dtype: int64

In [103]:
df

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.010552 -0.516349  0.011373 -0.831380
2013-01-03  1.217145 -0.020333 -1.796406 -0.423630
2013-01-04 -1.433384 -1.030200 -0.917391 -2.047165
2013-01-05 -2.108659 -0.203574  1.594526 -1.155929
2013-01-06 -1.242232  0.119530 -0.813179  0.090050

In [104]:
df.mean()

A   -0.379819
B   -0.009440
C   -0.116978
D   -1.082107
dtype: float64

In [105]:
df.mean(1)

2013-01-01    0.241643
2013-01-02   -0.081451
2013-01-03   -0.255806
2013-01-04   -1.357035
2013-01-05   -0.468409
2013-01-06   -0.461458
Freq: D, dtype: float64

In [106]:
df.mean(0)

A   -0.379819
B   -0.009440
C   -0.116978
D   -1.082107
dtype: float64

In [107]:
df.std()

A    1.397022
B    0.886033
C    1.317342
D    0.882491
dtype: float64

In [108]:
df.var()

A    1.951671
B    0.785055
C    1.735390
D    0.778791
dtype: float64

In [109]:
df.max()

A    1.217145
B    1.594284
C    1.594526
D    0.090050
dtype: float64

In [110]:
df.min()

A   -2.108659
B   -1.030200
C   -1.796406
D   -2.124586
dtype: float64

In [112]:
df.median()

A   -0.482282
B   -0.111953
C   -0.400903
D   -0.993655
dtype: float64

In [114]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.277667  1.594284  1.219209 -2.124586
2013-01-02  1.288219  1.077935  1.230582 -2.955966
2013-01-03  2.505364  1.057602 -0.565824 -3.379596
2013-01-04  1.071979  0.027403 -1.483215 -5.426761
2013-01-05 -1.036680 -0.176172  0.111310 -6.582691
2013-01-06 -2.278912 -0.056642 -0.701869 -6.492641

In [115]:
def dataa(x):
    return x.max()-x.min()

df.apply(dataa)

A    3.325804
B    2.624483
C    3.390932
D    2.214636
dtype: float64

In [116]:
df.apply(lambda x: x.max()- x.min())

A    3.325804
B    2.624483
C    3.390932
D    2.214636
dtype: float64

In [117]:
gender = pd.Series(["남자","여자","여자","여자","남","male"])

In [118]:
gender.value_counts()

여자      3
남자      1
남       1
male    1
dtype: int64

In [119]:
gender.replace("남","남자")

0      남자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [120]:
gender

0      남자
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [127]:
gender.replace(["남","male"],["남자","남자"],inplace=True)

In [129]:
gender.replace(["남자","여자"],["male","female"],inplace=True)

In [130]:
gender

0      male
1    female
2    female
3    female
4      male
5      male
dtype: object

In [124]:
gender.str.replace("남자","남")

0       남
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [125]:
gender

0      남자
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [126]:
gender.str.strip()

0      남자
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [131]:
df= pd.DataFrame(np.random.randn(10,4))

In [132]:
df

          0         1         2         3
0  0.597242  1.997109  1.214290  0.614634
1  1.597212 -1.517313 -0.949949 -2.215355
2 -0.572749  1.239324  0.881145 -1.066035
3  1.745571 -1.424651  0.036685 -0.401026
4 -0.595971  0.870772 -0.075432 -0.432524
5 -0.709121  0.076322  0.010267  0.770821
6  0.771155 -2.108319  0.414428 -1.562339
7  1.531769  0.062813  0.189741  0.028711
8 -0.527624  1.470215 -1.020838 -1.067744
9  1.561322  0.363781 -0.902247  0.109041

In [133]:
piece = [df[:3],df[3:7],df[7:]]

In [136]:
piece[0]

          0         1         2         3
0  0.597242  1.997109  1.214290  0.614634
1  1.597212 -1.517313 -0.949949 -2.215355
2 -0.572749  1.239324  0.881145 -1.066035

In [137]:
piece[1]

          0         1         2         3
3  1.745571 -1.424651  0.036685 -0.401026
4 -0.595971  0.870772 -0.075432 -0.432524
5 -0.709121  0.076322  0.010267  0.770821
6  0.771155 -2.108319  0.414428 -1.562339

In [138]:
piece[2]

          0         1         2         3
7  1.531769  0.062813  0.189741  0.028711
8 -0.527624  1.470215 -1.020838 -1.067744
9  1.561322  0.363781 -0.902247  0.109041

In [147]:
pd.concat([piece[0],piece[1],piece[2]],axis=0,join='inner')

          0         1         2         3
0  0.597242  1.997109  1.214290  0.614634
1  1.597212 -1.517313 -0.949949 -2.215355
2 -0.572749  1.239324  0.881145 -1.066035
3  1.745571 -1.424651  0.036685 -0.401026
4 -0.595971  0.870772 -0.075432 -0.432524
5 -0.709121  0.076322  0.010267  0.770821
6  0.771155 -2.108319  0.414428 -1.562339
7  1.531769  0.062813  0.189741  0.028711
8 -0.527624  1.470215 -1.020838 -1.067744
9  1.561322  0.363781 -0.902247  0.109041

In [149]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [150]:
left

   key  lval
0  foo     1
1  foo     2

In [151]:
right

   key  rval
0  foo     4
1  foo     5

In [152]:
pd.merge(left,right,on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [153]:
pd.merge(left,right,left_on="key",right_on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [159]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [160]:
left.join(right)

     lval  rval
key
foo     1     4
foo     1     5
foo     2     4
foo     2     5

In [161]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [162]:
df

     A      B         C         D
0  foo    one  0.710775  0.258095
1  bar    one -0.995047  0.295109
2  foo    two  0.840426  0.202759
3  bar  three  0.156796  0.770704
4  foo    two  0.513522 -0.347617
5  bar    two  0.991361 -0.007151
6  foo    one -0.152996 -0.003273
7  foo  three -0.448523 -0.345626

In [164]:
df.sum()

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                        1.616313
D                           0.823
dtype: object

In [168]:
test = df.groupby(["A","B"]).sum()

In [175]:
test1= test.stack()
test1.unstack(0)

A             bar       foo
B
one   C -0.995047  0.557778
      D  0.295109  0.254822
three C  0.156796 -0.448523
      D  0.770704 -0.345626
two   C  0.991361  1.353947
      D -0.007151 -0.144859

In [176]:
test1.unstack(1)

B           one     three       two
A
bar C -0.995047  0.156796  0.991361
    D  0.295109  0.770704 -0.007151
foo C  0.557778 -0.448523  1.353947
    D  0.254822 -0.345626 -0.144859

In [177]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [178]:
df

        A  B    C         D         E
0     one  A  foo -0.247049  0.257627
1     one  B  foo  0.228764 -1.384550
2     two  C  foo -1.090060  0.249902
3   three  A  bar -1.394686  1.767275
4     one  B  bar -0.127802 -0.278736
5     one  C  bar -1.570934  1.112911
6     two  A  foo  0.975408 -2.945963
7   three  B  foo  0.665604  0.324241
8     one  C  foo  0.410184 -0.938551
9     one  A  bar  1.039727  0.027081
10    two  B  bar  0.357065  0.482339
11  three  C  bar -0.053046  0.897296

In [181]:
test = pd.pivot_table(df,values="D",index=["A","B"],columns=["C"],aggfunc="sum")

In [182]:
test

C             bar       foo
A     B
one   A  1.039727 -0.247049
      B -0.127802  0.228764
      C -1.570934  0.410184
three A -1.394686       NaN
      B       NaN  0.665604
      C -0.053046       NaN
two   A       NaN  0.975408
      B  0.357065       NaN
      C       NaN -1.090060

In [183]:
test.melt()

      C     value
0   bar  1.039727
1   bar -0.127802
2   bar -1.570934
3   bar -1.394686
4   bar       NaN
5   bar -0.053046
6   bar       NaN
7   bar  0.357065
8   bar       NaN
9   foo -0.247049
10  foo  0.228764
11  foo  0.410184
12  foo       NaN
13  foo  0.665604
14  foo       NaN
15  foo  0.975408
16  foo       NaN
17  foo -1.090060

In [184]:
test.head(1)

C           bar       foo
A   B
one A  1.039727 -0.247049

In [185]:
test.head(2)

C           bar       foo
A   B
one A  1.039727 -0.247049
    B -0.127802  0.228764

In [186]:
test.head(3)

C           bar       foo
A   B
one A  1.039727 -0.247049
    B -0.127802  0.228764
    C -1.570934  0.410184

In [192]:
test.reset_index(inplace=True)

In [193]:
test.head(2)

C  level_0  index    A  B       bar       foo
0        0      0  one  A  1.039727 -0.247049
1        1      1  one  B -0.127802  0.228764

In [194]:
test.melt(id_vars=['A','B'])

        A  B        C     value
0     one  A  level_0  0.000000
1     one  B  level_0  1.000000
2     one  C  level_0  2.000000
3   three  A  level_0  3.000000
4   three  B  level_0  4.000000
5   three  C  level_0  5.000000
6     two  A  level_0  6.000000
7     two  B  level_0  7.000000
8     two  C  level_0  8.000000
9     one  A    index  0.000000
10    one  B    index  1.000000
11    one  C    index  2.000000
12  three  A    index  3.000000
13  three  B    index  4.000000
14  three  C    index  5.000000
15    two  A    index  6.000000
16    two  B    index  7.000000
17    two  C    index  8.000000
18    one  A      bar  1.039727
19    one  B      bar -0.127802
20    one  C      bar -1.570934
21  three  A      bar -1.394686
22  three  B      bar       NaN
23  three  C      bar -0.053046
24    two  A      bar       NaN
25    two  B      bar  0.357065
26    two  C      bar       NaN
27    one  A      foo -0.247049
28    one  B      foo  0.228764
29    one  C      foo  0.410184
30  three  A      foo       NaN
31  three  B      foo  0.665604
32  three  C      foo       NaN
33    two  A      foo  0.975408
34    two  B      foo       NaN
35    two  C      foo -1.090060

In [197]:
data = pd.read_csv('전라북도_소방서별 소방자동차 현황_20170810..csv',encoding='cp949')

In [198]:
data.melt(id_vars="시군")

      시군   variable  value
0     본부  고가차 53(m)    NaN
1     덕진  고가차 53(m)    1.0
2     완산  고가차 53(m)    NaN
3     군산  고가차 53(m)    NaN
4     익산  고가차 53(m)    1.0
..   ...        ...    ...
369   남원      버   스    NaN
370   김제      버   스    NaN
371   고창      버   스    NaN
372   부안      버   스    NaN
373  무진장      버   스    NaN

[374 rows x 3 columns]